---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSettings.SizePrefix
source: html/1eb2baf9-5b37-156d-3d92-a97b9aa30810.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSettings.SizePrefix Property

The conduit size prefix string.

## Syntax (C#)
```csharp
public string SizePrefix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null